In [23]:
People = {
    "first" : ['ujas','mahek','jigar'],
    "last" : ['lathiya','khanapara','vavaliya'],
    "email" : ['ujas123@gmail.com','mahek234@gmail.com','jigar@gmail.com']
}

# import pandas as pd
df = pd.DataFrame(People)
df

In [25]:
df['first'] + ' ' + df['last']

0       ujas lathiya
1    mahek khanapara
2     jigar vavaliya
dtype: object

In [26]:
df['full_name'] = df['first'] + ' ' + df['last']

In [27]:
df

   first       last               email        full_name
0   ujas    lathiya   ujas123@gmail.com     ujas lathiya
1  mahek  khanapara  mahek234@gmail.com  mahek khanapara
2  jigar   vavaliya     jigar@gmail.com   jigar vavaliya

In [28]:
df.drop(columns = ['first', 'last'])

                email        full_name
0   ujas123@gmail.com     ujas lathiya
1  mahek234@gmail.com  mahek khanapara
2     jigar@gmail.com   jigar vavaliya

In [29]:
df.drop(columns = ['first', 'last'], inplace=True)

In [30]:
df

                email        full_name
0   ujas123@gmail.com     ujas lathiya
1  mahek234@gmail.com  mahek khanapara
2     jigar@gmail.com   jigar vavaliya

In [31]:
df[['first','last']] = df['full_name'].str.split(' ', expand=True)

In [32]:
df

                email        full_name  first       last
0   ujas123@gmail.com     ujas lathiya   ujas    lathiya
1  mahek234@gmail.com  mahek khanapara  mahek  khanapara
2     jigar@gmail.com   jigar vavaliya  jigar   vavaliya

In [33]:
df.append({'first':'hardik'}, ignore_index=True)

C:\Users\Ujasl\AppData\Local\Temp\ipykernel_14960\3111205304.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first':'hardik'}, ignore_index=True)

                email        full_name   first       last
0   ujas123@gmail.com     ujas lathiya    ujas    lathiya
1  mahek234@gmail.com  mahek khanapara   mahek  khanapara
2     jigar@gmail.com   jigar vavaliya   jigar   vavaliya
3                 NaN              NaN  hardik        NaN

In [34]:
df

                email        full_name  first       last
0   ujas123@gmail.com     ujas lathiya   ujas    lathiya
1  mahek234@gmail.com  mahek khanapara  mahek  khanapara
2     jigar@gmail.com   jigar vavaliya  jigar   vavaliya

In [35]:
People2 = {
    "first" : ['kenil','yash','jenish'],
    "last" : ['vekariyia','senjalia','korat'],
    "email" : ['kenil02@gmail.com','yashsenj@gmail.com','jk007@gmail.com']
}

df2 = pd.DataFrame(People2)
df2

    first       last               email
0   kenil  vekariyia   kenil02@gmail.com
1    yash   senjalia  yashsenj@gmail.com
2  jenish      korat     jk007@gmail.com

In [36]:
df.append(df2, ignore_index=True)

C:\Users\Ujasl\AppData\Local\Temp\ipykernel_14960\26416246.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index=True)

                email        full_name   first       last
0   ujas123@gmail.com     ujas lathiya    ujas    lathiya
1  mahek234@gmail.com  mahek khanapara   mahek  khanapara
2     jigar@gmail.com   jigar vavaliya   jigar   vavaliya
3   kenil02@gmail.com              NaN   kenil  vekariyia
4  yashsenj@gmail.com              NaN    yash   senjalia
5     jk007@gmail.com              NaN  jenish      korat

In [37]:
df

                email        full_name  first       last
0   ujas123@gmail.com     ujas lathiya   ujas    lathiya
1  mahek234@gmail.com  mahek khanapara  mahek  khanapara
2     jigar@gmail.com   jigar vavaliya  jigar   vavaliya

In [38]:
df = df.append(df2, ignore_index=True)

C:\Users\Ujasl\AppData\Local\Temp\ipykernel_14960\445450659.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2, ignore_index=True)

In [39]:
df

                email        full_name   first       last
0   ujas123@gmail.com     ujas lathiya    ujas    lathiya
1  mahek234@gmail.com  mahek khanapara   mahek  khanapara
2     jigar@gmail.com   jigar vavaliya   jigar   vavaliya
3   kenil02@gmail.com              NaN   kenil  vekariyia
4  yashsenj@gmail.com              NaN    yash   senjalia
5     jk007@gmail.com              NaN  jenish      korat

In [40]:
df.drop(index=5)

                email        full_name  first       last
0   ujas123@gmail.com     ujas lathiya   ujas    lathiya
1  mahek234@gmail.com  mahek khanapara  mahek  khanapara
2     jigar@gmail.com   jigar vavaliya  jigar   vavaliya
3   kenil02@gmail.com              NaN  kenil  vekariyia
4  yashsenj@gmail.com              NaN   yash   senjalia

In [41]:
df

                email        full_name   first       last
0   ujas123@gmail.com     ujas lathiya    ujas    lathiya
1  mahek234@gmail.com  mahek khanapara   mahek  khanapara
2     jigar@gmail.com   jigar vavaliya   jigar   vavaliya
3   kenil02@gmail.com              NaN   kenil  vekariyia
4  yashsenj@gmail.com              NaN    yash   senjalia
5     jk007@gmail.com              NaN  jenish      korat

In [42]:
df.drop(index=5, inplace=True)

In [43]:
df

                email        full_name  first       last
0   ujas123@gmail.com     ujas lathiya   ujas    lathiya
1  mahek234@gmail.com  mahek khanapara  mahek  khanapara
2     jigar@gmail.com   jigar vavaliya  jigar   vavaliya
3   kenil02@gmail.com              NaN  kenil  vekariyia
4  yashsenj@gmail.com              NaN   yash   senjalia

In [45]:
filt = df['email'] =='jigar@gmail.com'
df.drop(index=df[filt].index)

                email        full_name  first       last
0   ujas123@gmail.com     ujas lathiya   ujas    lathiya
1  mahek234@gmail.com  mahek khanapara  mahek  khanapara
3   kenil02@gmail.com              NaN  kenil  vekariyia
4  yashsenj@gmail.com              NaN   yash   senjalia

In [46]:
df = df.drop(index = df[df['email'] == 'jigar@gmail.com'].index)

In [47]:
df

                email        full_name  first       last
0   ujas123@gmail.com     ujas lathiya   ujas    lathiya
1  mahek234@gmail.com  mahek khanapara  mahek  khanapara
3   kenil02@gmail.com              NaN  kenil  vekariyia
4  yashsenj@gmail.com              NaN   yash   senjalia

In [48]:
df.drop(index=df[df['first']=='kenil'].index, inplace=True)

In [49]:
df

                email        full_name  first       last
0   ujas123@gmail.com     ujas lathiya   ujas    lathiya
1  mahek234@gmail.com  mahek khanapara  mahek  khanapara
4  yashsenj@gmail.com              NaN   yash   senjalia